Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: If set to a positive number, the connector will try to resend any record that was not delivered successfully (with a potentially transient error) until the number of retries is reached. If set to 0, retries are disabled. If not set, the connector tries to resend any record that failed to be delivered (because of a potentially transient error) during an amount of time configured by `delivery.timeout.ms`. Type: _long_
pt_br: Se definido como um número positivo, o conector tentará reenviar qualquer registro que não tenha sido entregue com êxito (com um erro potencialmente transitório) até que o número de tentativas seja atingido. Se definido como 0, as novas tentativas serão desabilitadas. Se não estiver definido, o conector tentará reenviar qualquer registro que não tenha sido entregue (devido a um erro potencialmente transitório) durante um período de tempo configurado por 'delivery.timeout.ms'. Tipo: _long_

source: If the value is a number followed by `d`, it is prefixed with `P`.
pt_br: Se o valor for um número seguido de 'd', ele é prefixado com 'P'.

source: If the value is a number followed by `h`, `m`, or `s`, it is prefixed with `PT`.
pt_br: Se o valor for um número seguido de 'h', 'm' ou 's', ele é prefixado com 'PT'.

source: If the value is a number followed by `ms`, it represents time in milliseconds.
pt_br: Se o valor for um número seguido de 'ms', ele representa o tempo em milissegundos.

source: If the value is only a number, it represents time in seconds.
pt_br: Se o valor for apenas um número, ele representará o tempo em segundos.

source: If using Powershell, wrap `-D` parameters in double quotes e.g. `"-DprojectArtifactId={create-app-artifact-id}"`
pt_br: Se estiver usando o Powershell, envolva os parâmetros '-D' entre aspas duplas, por exemplo, '"-DprojectArtifactId={create-app-artifact-id}"'

source: If using cmd, (don't use backward slash `\` and put everything on the same line)
pt_br: Se estiver usando cmd, (não use barra invertida '\' e coloque tudo na mesma linha)

source: If you are a Java EE or Spring user, this development model should look familiar. You expose a resource containing methods annotated with <code>@GET</code>, <code>@POST</code>…&ZeroWidthSpace;&ZeroWidthSpace; to handle the different requests. The path is specified using the <code>@Path</code> annotation. Quarkus also supports <a href="https://quarkus.io/guides/spring-web">Spring controller</a> annotations such as <code>@GetMapping</code> or <code>@RestController</code>.
pt_br: Se você é um usuário Java EE ou Spring, esse modelo de desenvolvimento deve parecer familiar. Você expõe um recurso que contém métodos anotados com <code>@GET</code>, <code>@POST</code>... para lidar com as diferentes solicitações. O caminho é especificado usando a <code>@Path</code> anotação. O Quarkus também oferece suporte a anotações do <a href="https://quarkus.io/guides/spring-web">controlador Spring</a> , como <code>@GetMapping</code> ou <code>@RestController</code>.

source: If you are using Gradle in your project, you can use this sample Dockerfile. Save it in `src/main/docker/Dockerfile.multistage`.
pt_br: Se estiver utilizando o Gradle no seu projeto, pode utilizar este exemplo de Dockerfile. Salve-o em `src/main/docker/Dockerfile.multistage`.

source: If you ever want to build a native container image and already have an existing native image you can set `-Dquarkus.native.reuse-existing=true` and the native image build will not be re-run.
pt_br: Se você quiser construir uma imagem de contêiner nativa e já tiver uma imagem nativa existente, você pode definir `-Dquarkus.native.reuse-existing=true`. Isso evitará que a imagem nativa seja construída novamente

source: If you have generated the application from the previous tutorial, you can find in the `pom.xml` the following _profile_:
pt_br: Se gerou a aplicação do tutorial anterior, pode encontrar no `pom.xml` o seguinte profile:

source: If you need SSL support in your native executable, you can easily include the necessary libraries in your Docker image.
pt_br: Se precisar de suporte SSL no seu executável nativo, pode facilmente incluir as bibliotecas necessárias na sua imagem Docker.

source: If you require a higher level of support, you have options.
pt_br: Se você precisar de um nível mais alto de suporte, você tem opções.

source: If you see the following invalid path error for your application JAR when trying to create a native executable using a container build, even though your JAR was built successfully, you're most likely using a remote daemon for your container runtime.
pt_br: Se vir o seguinte erro de caminho inválido para o JAR da sua aplicação ao tentar criar um executável nativo utilizando uma build em contêiner, mesmo o JAR ter sido compilado com sucesso, é muito provável que esteja utilizando um daemon remoto para o tempo de execução do contêiner.

source: If you use Basic or form-based authentication, you must add an `IdentityProvider` instance to convert a username and password to a `SecurityIdentity` instance.
pt_br: Se você utilizar a Basic ou form-based, você precisará adicionar uma instãncia `IdentityProvider` para converter um username e um password em uma instância `SecurityIdentity`.

source: If you use a https://smallrye.io/smallrye-mutiny-vertx-bindings/latest/[Vert.x client using the Mutiny bindings], use the `andAwait()` methods which block until you get the result without pinning the carrier thread. It includes all the reactive SQL drivers.
pt_br: Se você estiver utilizando um link:https://smallrye.io/smallrye-mutiny-vertx-bindings/latest/[cliente Vert.x que utilize as ligações Mutiny], use os métodos `andAwait()` que bloqueiam até obter o resultado sem fixar a carrier thread. Isso inclui todos os drivers SQL reativos.

source: If you want to use another Redis for your cache, configure the `client-name` as follows:
pt_br: Se você pretende utilizar outro Redis para a sua cache, configure o `client-name` da seguinte forma:

source: If you want to use the AWS Gateway HTTP API, generate your project with this script:
pt_br: Se você quiser utilizar a API HTTP do AWS Gateway, gere o seu projeto com este script:

source: If you want to use the AWS Gateway REST API, generate your project with this script:
pt_br: Se você quiser utilizar a API REST do AWS Gateway, gere o seu projeto com este script:

source: If you're running a remote Docker daemon, you need to replace `quarkus.native.container-build=true` with `quarkus.native.remote-container-build=true`.
pt_br: Se estiver executando um daemon Docker remoto, você terá que substituir `quarkus.native.container-build=true` por `quarkus.native.remote-container-build=true`.

source: If your `@Transactional`-annotated method returns a reactive value, such as:
pt_br: Se o método anotado '@Transactional' retornar um valor reativo, como:

source: If your application employs eXtended Architecture (XA) transactions, enable the transaction crash recovery feature by using `quarkus.transaction-manager.enable-recovery=true`, to safeguard your data in the event of application crashes or failures. The default value for XA Recovery is `false`.
pt_br: Se seu aplicativo empregar transações XA (eXtended Architecture), habilite o recurso de recuperação de falhas de transação usando `quarkus.transaction-manager.enable-recovery=true`, para proteger seus dados em caso de falhas ou falhas do aplicativo. O valor padrão para XA Recovery é `false`.

source: Image type can be configured using
pt_br: O tipo da imagem pode ser configurado utilizando

source: Imperative
pt_br: Imperativo

source: Imperative and reactive code
pt_br: Código imperativo e reativo

source: Implementing GraphQL Services
pt_br: Implementando serviços GraphQL

source: Implementing gRPC Services
pt_br: Implementando serviços gRPC

source: Improve and expedite the inner loop development process with live coding where code changes are automatically reflected in your running application. code -> refresh browser -> repeat
pt_br: Melhore e agilize o processo de desenvolvimento de loop interno com codificação em tempo real, onde as alterações de código são refletidas automaticamente em sua aplicação em execução. código -> atualizar navegador -> repetir

source: In cloud environments where persistent storage is not available, such as when application containers are unable to use persistent volumes, you can configure the transaction management to store transaction logs in a database by using a JDBC datasource.
pt_br: Em ambientes de nuvem em que o armazenamento persistente não está disponível, como quando os contêineres de aplicativos não podem usar volumes persistentes, é possível configurar o gerenciamento de transações para armazenar logs de transações em um banco de dados usando uma fonte de dados JDBC.

source: In dev mode, you can use the xref:redis-dev-services.adoc[Redis Dev Service].
pt_br: No modo de desenvolvimento `dev mode`, você pode utilizar o xref:redis-dev-services.adoc[Redis Dev Service].

source: In other cases, the simplified format is translated to the `java.time.Duration` format for parsing:
pt_br: Em outros casos, o formato simplificado é traduzido para o formato 'java.time.Duration' para análise:

source: In the spirit of the times, the Quarkus Team virtually presents a big, loud, and bold, rock & roll mega-stadium tour.
pt_br: No espírito dos tempos, o Quarkus Team apresenta virtualmente uma grande, barulhenta e ousada turnê de mega-estádio de rock and roll.

source: In these cases, you can find all the keys managed by the default cache using `KEYS my-cache:*`, and all the keys managed by the `expensiveResourceCache` cache using: `KEYS my-expensive-cache:*`.
pt_br: Nestes casos, você pode encontrar todas as chaves gereciadas pela cache padrão utilizando `KEYS my-cache:*`, e todas as chaves gerenciadas pela cache `expensiveResourceCache` utilizando: `KEYS my-expensive-cache:*`.

source: In this case, use the parameter `-Dquarkus.native.remote-container-build=true` instead of `-Dquarkus.native.container-build=true`.
pt_br: Neste caso, utilize o parâmetro `-Dquarkus.native.remote-container-build=true` ao invés de `-Dquarkus.native.container-build=true`.

source: In this guide, we will discuss how you can get your native executables to support SSL, as native executables don't support it out of the box.
pt_br: Neste guia, discutiremos como você pode obter seus executáveis nativos para oferecer suporte a SSL, já que os executáveis nativos não oferecem suporte imediato a ele.

source: In this guide, we will explore:
pt_br: Neste guia, iremos explorar:

source: In this session the Quarkus Team will give you a unique, hands-on experience: An introduction to Quarkus, a follow-along hands-on demo or two and then a Q&A with some of the band, umm, developers involved.
pt_br: Nesta sessão, a Equipe do Quarkus lhe dará uma experiência prática única: uma introdução ao Quarkus, uma demonstração prática subsequente ou duas e, em seguida, uma sessão de perguntas e respostas com alguns dos desenvolvedores envolvidos.

source: In-Person and online events which feature Quarkus tracks, discussion and topics.
pt_br: Eventos presenciais e online que apresentam trilhas, discussões e tópicos do Quarkus.

source: Include JDK Flight Recorder support
pt_br: Incluir suporte para o JDK Flight Recorder

source: Incoming Attributes of the 'smallrye-kafka' connector
pt_br: Atributos de entrada do conector 'smallrye-kafka'

source: Incoming Attributes of the 'smallrye-pulsar' connector
pt_br: Atributos de entrada do conector 'smallrye-pulsar'

source: Increment a value given its key
pt_br: Incrementa um valor dada a sua chave

source: Increment the `first` value by 27.
pt_br: Incrementa o valor `primeira` em 27.

source: Increment the value associated with the given key
pt_br: Incrementa o valor associado à chave indicada

source: Infinispan is an in memory data grid that allows running in a server outside of application processes. This extension provides functionality to allow the client that can connect to said server when running in Quarkus.
pt_br: Infinispan é uma malha de dados em memória que permite a execução em um servidor externo aos processos de uma aplicação. Essa extensão fornece funcionalidade para permitir que o cliente que pode se conectar ao referido servidor ao executar no Quarkus.

source: Initial backoff interval (in nanosecond).
pt_br: Intervalo de recuo inicial (em nanossegundos).

source: Initial position at which to set cursor when subscribing to a topic at first time.
pt_br: Posição inicial na qual definir o cursor ao se inscrever em um tópico pela primeira vez.

source: Inject a preconfigured Keycloak Admin Client.
pt_br: Injete um Keycloak Admin Client pré-configurado.

source: Inject both the imperative and reactive data sources
pt_br: Injeta os datasources imperativo e reativo

source: Inject the `TransactionManager` to be able to activate `setRollbackOnly` semantic.
pt_br: Injete o `TransactionManager` para poder ativar a semântica `setRollbackOnly`.

source: Injectable AWS Context Variables
pt_br: Variáveis de contexto AWS injetáveis

source: Inspecting the list of consumer groups and their consumption lag
pt_br: Inspeção da lista de grupos de consumidores e do respetivo desfasamento de consumo

source: Install GraalVM if you haven't already. You have a few options for this:
pt_br: Instale o GraalVM se ainda não o fez. Existem algumas opções para isso:

source: Installing AWS bits
pt_br: Instalando os componentes AWS

source: Installing via scoop will do this for you.
pt_br: A instalação através do scoop irá fazer tudo por você.

source: Integration
pt_br: Integração

source: Interacting with the application
pt_br: Interagindo com a aplicação

source: Interface for custom message is ackTimeout policy. You can specify `RedeliveryBackoff` for a consumer.
pt_br: Interface para mensagem personalizada é a política ackTimeout. Você pode especificar 'RedeliveryBackoff' para um consumidor.

source: Interface for custom message is negativeAcked policy. You can specify `RedeliveryBackoff` for a consumer.
pt_br: Interface para mensagem personalizada é política negativeAcked. Você pode especificar 'RedeliveryBackoff' para um consumidor.

source: Interval to print client stats (in seconds).
pt_br: Intervalo para imprimir estatísticas do cliente (em segundos).

source: Introduction to CDI
pt_br: Introdução à CDI

source: Introduction to writing REST JSON Services
pt_br: Introdução à escrita de serviços REST JSON

source: Issues using GraalVM with macOS
pt_br: Problemas ao usar o GraalVM com o macOS

source: Issues with packaging on Windows
pt_br: Problemas com o empacotamento no Windows

source: It does not enable/disable SnapStart for your function, only the Quarkus optimizations.
pt_br: Isso não ativa/desactiva o SnapStart para a sua função, apenas as otimizações do Quarkus.

source: It is essential to understand that these issues are not Quarkus limitations or bugs but are due to the current state of the Java ecosystem which needs to evolve to become virtual thread friendly.
pt_br: É essencial compreender que estes problemas não são limitações ou bugs do Quarkus, mas sim devidos ao estado atual do ecossistema Java, que precisa evoluir para se tornar compatível com as threads virtuais.

source: It's a mess because I don't know if my Jakarta Persistence persistence unit is using `JTA` or `Resource-level` Transaction
pt_br: É uma bagunça porque não sei se minha unidade de persistência Jakarta Persistence está usando a transação 'JTA' ou 'Resource-level'

source: It’s going to be a blast. 90 odd minutes of technical discussion, some live coding and a Q&A.
pt_br: Vai ser uma explosão. 90 minutos ímpares de discussão técnica, alguns códigos ao vivo e um Q&A.

source: JDBC datasources and ActiveMQ Artemis allow the enlistment and automatically register the `XAResourceRecovery`.
pt_br: Os recursos de dados JDBC e o ActiveMQ Artemis permitem a inscrição e registram automaticamente o `XAResourceRecovery`.

source: JDBC datasources is part of `quarkus-agroal`, and it needs to use `quarkus.datasource.jdbc.transactions=XA`.
pt_br: Os recursos de dados JDBC fazem parte de `quarkus-agroal` e precisam ser usados em `quarkus.datasource.jdbc.transactions=XA`.

source: JDK 11+ installed with `JAVA_HOME` configured appropriately
pt_br: JDK 11+ instalado com 'JAVA_HOME' configurado adequadamente

source: JSON is now the lingua franca between microservices. In this guide, we see how you can get your REST services to consume and produce JSON payloads.
pt_br: O JSON é agora a língua franca entre os microsserviços. Neste guia, veremos como você pode fazer com que seus serviços REST consumam e produzam JSON.

source: JSON is now the lingua franca between microservices. See how you can get your REST services to consume and produce JSON payloads.
pt_br: JSON é agora a língua franca entre microsserviços. Veja como você pode fazer com que seus serviços REST consumam e produzam cargas JSON úteis.

source: Join the Quarkus Community
pt_br: Junte-se à Comunidade Quarkus

source: Join us as we explore how Quarkus helps Java developers everywhere to be more productive, create modern masterpieces and, have a little bit more fun.
pt_br: Junte-se a nós enquanto exploramos como o Quarkus ajuda desenvolvedores Java em todos os lugares a serem mais produtivos, criarem obras-primas modernas e se divertirem um pouco mais.

source: Json path of Principal Name
pt_br: Caminho Json do nome principal

source: Just assign the transaction xref:cdi.adoc#bean-scope[scope] to such beans using the `@TransactionScoped` annotation:
pt_br: Basta atribuir o link:cdi.html#bean-scope[âmbito] da transação a esses beans utilizando a anotação `@TransactionScoped`:

source: Kafka Dev UI is part of the Quarkus Dev UI and is only available in development mode.
pt_br: A Kafka Dev UI faz parte da interface de desenvolvimento do Quarkus e só está disponível no modo de desenvolvimento.

source: Kafka Streams with Quarkus
pt_br: Kafka Streams com Quarkus

source: Keep confidential your database credentials by storing them in Vault.
pt_br: Mantenha confidenciais suas credenciais de banco de dados armazenando-as no Vault.

source: Keycloak Admin Client
pt_br: Cliente de administração Keycloak

source: Kogito Dev Services
pt_br: Dev Services Kogito

source: Kube-Native
pt_br: Kube-Nativo

source: Kubernetes Native
pt_br: Kubernetes nativo

source: Kubernetes configuration example
pt_br: Exemplo de configuração do Kubernetes

source: Kubernetes, but also bare metal
pt_br: Kubernetes, mas também bare metal

source: Kubernetes-native Spring Apps on Quarkus
pt_br: Aplicativos Spring nativos do Kubernetes no Quarkus

source: Lead Developer on the Adoptium Technical Steering Committee
pt_br: Desenvolvedor Líder no Comitê de Direção Técnica da Adoptium

source: Learn Quarkus basics by standing up a straightforward application serving a hello endpoint.
pt_br: Aprenda os conceitos básicos do Quarkus levantando um aplicativo direto que atende a um ponto de extremidade de saudação.

source: Learn everything you need to know about the Qute template engine.
pt_br: Saiba tudo o que você precisa saber sobre o mecanismo de modelo do Qute.

source: Learn how to benefit from Java 19 virtual threads when writing REST services in Quarkus.
pt_br: Saiba como se beneficiar dos threads virtuais Java 19 ao escrever serviços REST no Quarkus.

source: Learn how to build and push container images with Jib, S2I or Docker as part of the Quarkus build.
pt_br: Saiba como criar e enviar imagens de contêiner com Jib, S2I ou Docker como parte da compilação do Quarkus.

source: Learn how to create a reactive application with Quarkus and explore the different features offered by Quarkus.
pt_br: Saiba como criar um aplicativo reativo com o Quarkus e explore os diferentes recursos oferecidos pelo Quarkus.

source: Learn how to create, package, and deploy a Hello World Quarkus application including a JAX-RS endpoint and functional tests.
pt_br: Saiba como criar, empacotar e implantar um aplicativo Hello World Quarkus, incluindo um endpoint JAX-RS e testes funcionais.

source: Learn how to customize the Redis client to your needs.
pt_br: Saiba como personalizar o cliente Redis de acordo com suas necessidades.

source: Learn how to get your extension contribute features to the Dev UI.
pt_br: Saiba como fazer com que a sua extensão contribua com funcionalidades para a interface do usuário do desenvolvedor.

source: Learn how to integrate your extension with Quarkus' CDI container.
pt_br: Saiba como integrar sua extensão com o contêiner CDI do Quarkus.

source: Learn how to use SmallRye Stork for service discovery and load balancing.
pt_br: Saiba como usar o SmallRye Stork para descoberta de serviços e balanceamento de carga.

source: Learn how to use SmallRye Stork in a Kubernetes environment.
pt_br: Saiba como usar o SmallRye Stork em um ambiente Kubernetes.

source: Learn how to use continuous testing in your Quarkus Application.
pt_br: Saiba como usar o teste contínuo em sua aplicação Quarkus.

source: Learn how you can reduce the size of your native executables with UPX.
pt_br: Saiba como você pode reduzir o tamanho de seus executáveis nativos com UPX.

source: Learn more about Quarkus class loading infrastructure.
pt_br: Saiba mais sobre a infraestrutura de carregamento de classes do Quarkus.

source: Learn more about Quarkus extensions metadata
pt_br: Saiba mais sobre os metadados das extensões do Quarkus

source: Learn more about Quarkus integrations in IDEs.
pt_br: Saiba mais sobre as integrações do Quarkus em IDEs.

source: Learn more about Quarkus reactive architecture.
pt_br: Saiba mais sobre a arquitetura reativa do Quarkus.

source: Learn more about configuring Quarkus' Vert.x based HTTP layer - and Undertow if you are using servlets.
pt_br: Saiba mais sobre como configurar a camada HTTP baseada em Vert.x do Quarkus - e Undertow se você estiver usando servlets.

source: Learn more about developing reactive applications with Quarkus.
pt_br: Saiba mais sobre como desenvolver aplicações reativas com o Quarkus.

source: Learn more about how Quarkus handles authentication.
pt_br: Saiba mais sobre como o Quarkus lida com a autenticação.

source: Learn more about how to configure your Quarkus applications.
pt_br: Saiba mais sobre como configurar as suas aplicações Quarkus.

source: Learn more about how to develop reactive applications with Quarkus.
pt_br: Saiba mais sobre como desenvolver aplicações reactivas com o Quarkus.

source: Learn more about how you can pass contextual information with SmallRye Context Propagation.
pt_br: Saiba mais sobre como você pode passar informações contextuais com o SmallRye Context Propagation.

source: Learn more about how you can send email from a Quarkus application with our reactive email client.
pt_br: Saiba mais sobre como você pode enviar e-mails de uma aplicação Quarkus com nosso cliente de e-mail reativo.

source: Learn more about how you can use templating in your applications with the Qute template engine.
pt_br: Saiba mais sobre como você pode usar o modelo de modelagem em seus aplicativos com o mecanismo de modelo do Qute.

source: Learn more about how you extract content from documents using the Apache Tika toolkit.
pt_br: Saiba mais sobre como extrair conteúdo de documentos usando o kit de ferramentas Apache Tika.

source: Learn more about the Scheduler extension.
pt_br: Saiba mais sobre a extensão Scheduler.

source: Learn more about the base runtime image used by Quarkus for native executables and how you can tweak it.
pt_br: Saiba mais sobre a imagem de tempo de execução base usada pelo Quarkus para executáveis nativos e como você pode ajustá-la.
